Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0016GPL028.PIC
      <edc:SFRDef edc:_addr="0x1F80F1D0" edc:_begin="0x80" edc:_end="0x150" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="16" edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC9" edc:desc="" edc:impl="0xffffff60" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000--------" edc:name="IPC9" edc:nzwidth="32" edc:por="---00000---00000---00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIS" edc:desc="" edc:mask="0x3" edc:name="SPI2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2EIP" edc:desc="" edc:mask="0x7" edc:name="SPI2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F1E0" edc:_begin="0x80" edc:_end="0x150" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="16" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC10" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC10" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2RXIS" edc:desc="" edc:mask="0x3" edc:name="U2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2RXIP" edc:desc="" edc:mask="0x7" edc:name="U2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2TXIS" edc:desc="" edc:mask="0x3" edc:name="U2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2TXIP" edc:desc="" edc:mask="0x7" edc:name="U2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2EIS" edc:desc="" edc:mask="0x3" edc:name="U2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2EIP" edc:desc="" edc:mask="0x7" edc:name="U2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2SIS" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="I2C2SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2SIP" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x7" edc:name="I2C2SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F1F0" edc:_begin="0x80" edc:_end="0x150" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="16" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC11" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC11" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C2MIS" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="I2C2MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2MIP" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x7" edc:name="I2C2MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2BCIS" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="I2C2BCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2BCIP" edc:desc="" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x7" edc:name="I2C2BCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="NVMIS" edc:desc="" edc:mask="0x3" edc:name="NVMIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="NVMIP" edc:desc="" edc:mask="0x7" edc:name="NVMIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CPCIS" edc:desc="" edc:mask="0x3" edc:name="CPCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CPCIP" edc:desc="" edc:mask="0x7" edc:name="CPCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F200" edc:_begin="0x80" edc:_end="0x150" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="16" edc:access="-------------------nnnnn--------" edc:cname="IPC12" edc:desc="" edc:impl="0x1f00" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="-------------------00000--------" edc:name="IPC12" edc:nzwidth="32" edc:por="-------------------00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ECCSBEIS" edc:mask="0x3" edc:name="ECCSBEIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ECCSBEIP" edc:mask="0x7" edc:name="ECCSBEIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1FC41840" edc:endaddr="0x1FC41854" edc:kseg0="0x80000000" edc:kseg1="0xA0000000" edc:ksegdef="1" edc:regionid="UDIDx">
      <edc:SFRDef edc:_addr="0x1FC41840" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID1" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1FC41844" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID2" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1FC41848" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID3" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1FC4184C" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID4" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
